Fix CI, Docs and Tests
Make CI more robust (and green)
Make docs correct and fix references
Update e2e tests and push e2e tests into unit tests when possible.
